ToDone/app/views/categories/show.html.erb

SELECT "events".* FROM "events" WHERE "events"."category_id" = ?  [["category_id", 1]]
---
	<tbody>
		<% @category.events.each do |i| %>