ToDone/app/controllers/events_controller.rb

	def index
		@all_events = Event.all
---
SELECT "events".* FROM "events"

	def create
		# There is a naming convention when using Ruby on Rails to build a Web Application
		# You had better name the below instance variable as "event", in its singular form
		@event = Event.new(event_params)
		if @event.save
---
INSERT INTO "events" ("title", "time", "place", "details", "category_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)

	def update
		@event = Event.find(params[:id])

		if @event.update(event_params)
---
SELECT  "events".* FROM "events" WHERE "events"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "events" SET "place" = ?, "updated_at" = ? WHERE "events"."id" = ?  [["place", "Kent Ridge Hall, NUS"], ["updated_at", 2017-01-29 16:04:57 UTC], ["id", 2]]