app/controllers/categories_controller.rb

	def show
		@categories = Category.all
		@category = Category.find(params[:id])
---
SELECT "categories".* FROM "categories"
SELECT  "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

	def edit
		@categories = Category.all
		@category = Category.find(params[:id])
---
SELECT "categories".* FROM "categories"
SELECT  "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]

	def create
		@category = Category.new(category_params)

		if @category.save
---
INSERT INTO "categories" ("name", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Home"], ["description", "This category stores all the matters related to family issues."], ["created_at", 2017-01-29 13:47:52 UTC], ["updated_at", 2017-01-29 13:47:52 UTC]]

	def update
		@category = Category.find(params[:id])
---
SELECT  "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]